### Reference: pandas.pdf

#### Date: 30/9/2021

## Series

In [3]:
import pandas as pd
obj = pd.Series([4, 7, 1, 9])
obj

0    4
1    7
2    1
3    9
dtype: int64

In [4]:
obj.values

array([4, 7, 1, 9], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
# Adding index to series
obj2 = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])
obj2

a    10
b    20
c    30
d    40
dtype: int64

In [7]:
# Extracting data by index
print(obj2['a'])
print(obj2['d'])
print(obj2[['b', 'c', 'a']])

10
40
b    20
c    30
a    10
dtype: int64

In [8]:
# Python Dictionary to Pandas Series

sdata={'Mumbai': 1000, 'Pune': 800, 'Nashik': 700, 'Thane': 750, 'Nagpur': 690}
obj3 = pd.Series(sdata)
obj3

Mumbai    1000
Pune       800
Nashik     700
Thane      750
Nagpur     690
dtype: int64

In [9]:
# Changing Index of series
obj2.index =['Rohit', 'Ram', 'Mahesh', 'Ashish']
obj2

Rohit     10
Ram       20
Mahesh    30
Ashish    40
dtype: int64

## DataFrame

In [10]:
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [11]:
# Dataframe from lists
data = [1, 2, 3, 4, 5]
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [12]:
data2 = [['Snehal', 20], ['Vaishnavi', 21],['Sakshi', 25],['Ashlesha', 22]]
df = pd.DataFrame(data2, columns=['Name','Age'])
print(df)

        Name  Age
0     Snehal   20
1  Vaishnavi   21
2     Sakshi   25
3   Ashlesha   22

In [13]:
data2 = [['Snehal', 20], ['Vaishnavi', 21],['Sakshi', 25],['Ashlesha', 22]]
df = pd.DataFrame(data2, columns=['Name','Age'], dtype=float)
print(df)

        Name   Age
0     Snehal  20.0
1  Vaishnavi  21.0
2     Sakshi  25.0
3   Ashlesha  22.0

In [14]:
# DataFrame from Dict of list
data3 = {'Name': ['Rahul', 'Sahil', 'Mayur'], 'Age': [28, 33, 25]}
df = pd.DataFrame(data3)
print(df)

    Name  Age
0  Rahul   28
1  Sahil   33
2  Mayur   25

In [15]:
data3 = {'Name': ['Rahul', 'Sahil', 'Mayur'], 'Age': [28, 33, 25]}
df = pd.DataFrame(data3, index=['rank1', 'rank2', 'rank3'])
print(df)

        Name  Age
rank1  Rahul   28
rank2  Sahil   33
rank3  Mayur   25

In [16]:
# DataFrame from list of Dict
data = [{'a': 1, 'b': 2}, {'a': 10, 'b': 14, 'c': 17}]
df = pd.DataFrame(data)
print(df)

    a   b     c
0   1   2   NaN
1  10  14  17.0

In [17]:
# DataFrame from Dict of Series
d = {'one': pd.Series([1, 2, 3], index=['A', 'B', 'C']), 'two': pd.Series([1, 2, 3, 4], index=['A', 'B', 'C', 'D'])}
df =pd.DataFrame(d)
print(df)

   one  two
A  1.0    1
B  2.0    2
C  3.0    3
D  NaN    4

In [18]:
#Column Selection
print(d['one'])

A    1
B    2
C    3
dtype: int64

In [19]:
# Column Addition
print("Adding a new column by passing as a series: ")
df['three'] = pd.Series([10, 20, 30], index=['A', 'B', 'C'])
print(df)

Adding a new column by passing as a series:
   one  two  three
A  1.0    1   10.0
B  2.0    2   20.0
C  3.0    3   30.0
D  NaN    4    NaN

In [20]:
print("Adding a new column using the existing columns in DataFrame: ")
df['four'] = df['one'] + df['two']
print(df)

Adding a new column using the existing columns in DataFrame:
   one  two  three  four
A  1.0    1   10.0   2.0
B  2.0    2   20.0   4.0
C  3.0    3   30.0   6.0
D  NaN    4    NaN   NaN

In [21]:
# Column Deletion
print("Deleting first column: ")
del df['one']

print(df)

print("Deleting another column: ")
del df['three']

print(df)

Deleting first column:
   two  three  four
A    1   10.0   2.0
B    2   20.0   4.0
C    3   30.0   6.0
D    4    NaN   NaN
Deleting another column:
   two  four
A    1   2.0
B    2   4.0
C    3   6.0
D    4   NaN

In [22]:
# Addition of rows

df = pd.DataFrame([[1,2], [3,4]], columns=['a', 'b'])
df2 = pd.DataFrame([[5,6], [7,8]], columns=['a', 'b'])

df = df.append(df2)
print(df)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [23]:
# Slice Rows
d = {'one': pd.Series([1, 2, 3], index=['A', 'B', 'C']), 'two': pd.Series([1, 2, 3, 4], index=['A', 'B', 'C', 'D'])}
df =pd.DataFrame(d)

print(df[2:4])

   one  two
C  3.0    3
D  NaN    4

#### Date: 7/10/2021

### Pandas Input/Output tools

In [24]:
import pandas as pd
df = pd.read_csv("carprices.csv")
print(df)

                 CarModel  Mileage  SellPrice  Age
0                  BMW X5    69000      18000    6
1                  BMW X5    35000      34000    3
2                  BMW X5    57000      26100    5
3                  BMW X5    22500      40000    2
4                  BMW X5    46000      31500    4
5                 Audi A5    59000      29400    5
6                 Audi A5    52000      32000    5
7                 Audi A5    72000      19300    6
8                 Audi A5    91000      12000    8
9   Mercedez Benz C class    67000      22000    6
10  Mercedez Benz C class    83000      20000    7
11  Mercedez Benz C class    79000      21000    7
12  Mercedez Benz C class    59000      33000    5

In [25]:
# Creating a Dataframe

import numpy as np

#Create a dictionary of series
d = {'Name' : pd.Series(['Arya', 'Manali', 'Mohini', 'Suraj', 'Ram', 'Rushi', 'Naina', 'Ayush', 'Sayali', 'Prajkta']),
    'Age': pd.Series([25, 36, 29, 17, 31, 20, 45, 38, 40, 24]),
    'Rating': pd.Series([4.23, 3.44, 4.90, 3.89, 3.66, 2.98, 4.56, 4.80,3.33, 3.12])}

df = pd.DataFrame(d)
print(df)

      Name  Age  Rating
0     Arya   25    4.23
1   Manali   36    3.44
2   Mohini   29    4.90
3    Suraj   17    3.89
4      Ram   31    3.66
5    Rushi   20    2.98
6    Naina   45    4.56
7    Ayush   38    4.80
8   Sayali   40    3.33
9  Prajkta   24    3.12

In [26]:
#Sum
print(df.sum())

Name      AryaManaliMohiniSurajRamRushiNainaAyushSayaliP...
Age                                                     305
Rating                                                38.91
dtype: object

In [27]:
# Mean
print(df.mean())

Age       30.500
Rating     3.891
dtype: float64

In [28]:
# std
print(df.std())

Age       9.156054
Rating    0.699420
dtype: float64

In [29]:
# Summarizing data using describe()
print(df.describe())

             Age    Rating
count  10.000000  10.00000
mean   30.500000   3.89100
std     9.156054   0.69942
min    17.000000   2.98000
25%    24.250000   3.35750
50%    30.000000   3.77500
75%    37.500000   4.47750
max    45.000000   4.90000

In [30]:
#  Pandas Concatenation
one = pd.DataFrame({'Name':['Snehal', 'Vaishnavi', 'Sakshi', 'Srushti'],
                    'Subject_id':['sub1', 'sub2', 'sub3', 'sub4'],
                    'Marks':[98, 90, 85, 91]},
                    index=[1, 2, 3, 4])
two = pd.DataFrame({'Name':['Rahul', 'Abhijit', 'Mayur', 'Swapnil'],
                    'Subject_id':['sub4', 'sub1', 'sub3', 'sub2'],
                    'Marks':[88, 92, 75, 81]},
                    index=[1, 2, 3, 4])
print(pd.concat([one,two]))

        Name Subject_id  Marks
1     Snehal       sub1     98
2  Vaishnavi       sub2     90
3     Sakshi       sub3     85
4    Srushti       sub4     91
1      Rahul       sub4     88
2    Abhijit       sub1     92
3      Mayur       sub3     75
4    Swapnil       sub2     81

In [31]:
# Reading and Exploring data frames
df = pd.read_csv("carprices.csv")
df.head()

  CarModel  Mileage  SellPrice  Age
0   BMW X5    69000      18000    6
1   BMW X5    35000      34000    3
2   BMW X5    57000      26100    5
3   BMW X5    22500      40000    2
4   BMW X5    46000      31500    4

In [32]:
# data types
df['SellPrice'].dtype

dtype('int64')

In [33]:
df.dtypes

CarModel     object
Mileage       int64
SellPrice     int64
Age           int64
dtype: object

## Hands-on Exercise

In [34]:
# creating salaries.csv

df=pd. DataFrame({'Rank':['Prof','Prof','Prof','Prof','Prof'],
                 'Discipline':['B', 'A', 'A', 'A', 'B'],
                 'PhD':[56, 12, 23, 40, 20],
                 'Services':[49, 6, 20, 31, 18],
                 'Sex':['Male','Male', 'Male', 'Male', 'Male'],
                 'Salary':[186960, 93000, 110515, 131205, 104800]})
print(df)

   Rank Discipline  PhD  Services   Sex  Salary
0  Prof          B   56        49  Male  186960
1  Prof          A   12         6  Male   93000
2  Prof          A   23        20  Male  110515
3  Prof          A   40        31  Male  131205
4  Prof          B   20        18  Male  104800

In [35]:
# Calculate Basic statistics for Salary column
print(df['Salary'].describe())

count         5.000000
mean     125296.000000
std       37144.854186
min       93000.000000
25%      104800.000000
50%      110515.000000
75%      131205.000000
max      186960.000000
Name: Salary, dtype: float64

In [36]:
# Find how many values in salary column
print(df['Salary'].count())

5

In [37]:
# Calculate average salary
print(df['Salary'].mean())

125296.0

## Group By

In [40]:
df.groupby('Rank')[['Salary']].mean()

      Salary
Rank
Prof  125296

### Filtering

In [44]:
df_sub = df[df['Salary']>100000]
print(df_sub)

   Rank Discipline  PhD  Services   Sex  Salary
0  Prof          B   56        49  Male  186960
2  Prof          A   23        20  Male  110515
3  Prof          A   40        31  Male  131205
4  Prof          B   20        18  Male  104800

In [46]:
df_f = df[df['Sex'] == 'Male']
print(df_f)

   Rank Discipline  PhD  Services   Sex  Salary
0  Prof          B   56        49  Male  186960
1  Prof          A   12         6  Male   93000
2  Prof          A   23        20  Male  110515
3  Prof          A   40        31  Male  131205
4  Prof          B   20        18  Male  104800

In [49]:
# DataFrame Slicing

df[['Salary']]

   Salary
0  186960
1   93000
2  110515
3  131205
4  104800

In [48]:
df[['Rank', 'Salary']]

   Rank  Salary
0  Prof  186960
1  Prof   93000
2  Prof  110515
3  Prof  131205
4  Prof  104800

### Data Frames: Selecting rows

In [50]:
df[2:4]

   Rank Discipline  PhD  Services   Sex  Salary
2  Prof          A   23        20  Male  110515
3  Prof          A   40        31  Male  131205

### method loc (to select range of rows using their labels)

In [51]:
df_sub.loc[2:4, ['Rank', 'Sex', 'Salary']]

   Rank   Sex  Salary
2  Prof  Male  110515
3  Prof  Male  131205
4  Prof  Male  104800

### iloc

In [52]:
df_sub.iloc[2:4, [0, 4,3,5]]

   Rank   Sex  Services  Salary
3  Prof  Male        31  131205
4  Prof  Male        18  104800

In [53]:
df.iloc[0]

Rank            Prof
Discipline         B
PhD               56
Services          49
Sex             Male
Salary        186960
Name: 0, dtype: object

In [54]:
df.iloc[1]

Rank           Prof
Discipline        A
PhD              12
Services          6
Sex            Male
Salary        93000
Name: 1, dtype: object

In [55]:
df.iloc[-1]

Rank            Prof
Discipline         B
PhD               20
Services          18
Sex             Male
Salary        104800
Name: 4, dtype: object

In [56]:
df.iloc[:, 0]

0    Prof
1    Prof
2    Prof
3    Prof
4    Prof
Name: Rank, dtype: object

In [57]:
df.iloc[:, -1]

0    186960
1     93000
2    110515
3    131205
4    104800
Name: Salary, dtype: int64

In [58]:
df.iloc[0:3]  #first 3 rows

   Rank Discipline  PhD  Services   Sex  Salary
0  Prof          B   56        49  Male  186960
1  Prof          A   12         6  Male   93000
2  Prof          A   23        20  Male  110515

In [59]:
df.iloc[:, 0:2]

   Rank Discipline
0  Prof          B
1  Prof          A
2  Prof          A
3  Prof          A
4  Prof          B

In [60]:
df.iloc[1:3, 0:2]

   Rank Discipline
1  Prof          A
2  Prof          A

In [65]:
df.iloc[[1,3], [1,5]]

  Discipline  Salary
1          A   93000
3          A  131205

### Sorting

In [66]:
df_sorted = df.sort_values(by ='Services')
df_sorted.head()

   Rank Discipline  PhD  Services   Sex  Salary
1  Prof          A   12         6  Male   93000
4  Prof          B   20        18  Male  104800
2  Prof          A   23        20  Male  110515
3  Prof          A   40        31  Male  131205
0  Prof          B   56        49  Male  186960

In [67]:
df_sorted = df.sort_values(by =['Services', 'Salary'], ascending=[True, False])
df_sorted.head()

   Rank Discipline  PhD  Services   Sex  Salary
1  Prof          A   12         6  Male   93000
4  Prof          B   20        18  Male  104800
2  Prof          A   23        20  Male  110515
3  Prof          A   40        31  Male  131205
0  Prof          B   56        49  Male  186960

### Missing values

In [68]:
data = pd.read_csv('titanic.csv')
data[data.isnull().any(axis=1)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [72]:
data.fillna(0).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,0,S

### Aggregate Functions

In [73]:
data[['Age', 'Fare']].agg(['min', 'mean','max'])

            Age        Fare
min    0.420000    0.000000
mean  29.699118   32.204208
max   80.000000  512.329200